Added several features and toggles to improve optimizer:\ - Toggle for instance normalization, set to off by default - Init_sequence option to set starting sequence for solver - Updated documentation with potential edge cases
